src/cf/InformationRegisters/ШкалаБонусныхПроцентовОтДизайнерскихПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ШкалаБонусныхПроцентовОтДизайнерскихПродаж</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>БонусныйПроцент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипРасчетаБонуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРасчетаБонусов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРасчетаБонуса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидБонуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыБонусов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КатегорияТовара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗначенияСвойствОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НижнийПорогСкидкиДляКлиента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВерхнийПорогСкидкиДляКлиента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ТипыРасчетаБонусов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ТипыРасчетаБонусов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РасчетПоВидамЦен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетПоСегментамНоменклатуры</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/ШкалаБонусныхПроцентовОтДизайнерскихПродаж/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВидРасчетаБонусаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ПроверитьЗаполнениеРеквизитов("ТипРасчетаБонуса") Тогда 
		Возврат
	КонецЕсли;
	
	УстановитьТипВидРасчетаБонусаНаСервере();	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТипВидРасчетаБонусаНаСервере()

	Если Запись.ТипРасчетаБонуса = Перечисления.ТипыРасчетаБонусов.РасчетПоВидамЦен Тогда
		ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.ВидыЦен");
		ЗначениеТипа = Справочники.ВидыЦен.ПустаяСсылка();
	ИначеЕсли Запись.ТипРасчетаБонуса = Перечисления.ТипыРасчетаБонусов.РасчетПоСегментамНоменклатуры Тогда
		ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.СегментыНоменклатуры");
		ЗначениеТипа = Справочники.СегментыНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	Элементы.ВидРасчетаБонуса.ОграничениеТипа = ОписаниеТипа;
	Элементы.ВидРасчетаБонуса.ОграничениеТипа.ПривестиЗначение(ЗначениеТипа);
	Элементы.ВидРасчетаБонуса.ВыбиратьТип = Ложь;	
	
КонецПроцедуры

&НаСервере
Функция ПроверитьЗаполнениеРеквизитов(ИмяРеквизита)
	
	Если Запись[ИмяРеквизита].Пустая() Тогда
		Сообщение = Новый СообщениеПользователю;
	 	Сообщение.Поле = "Запись." + ИмяРеквизита;
	 	Сообщение.Текст = "Поле """ + ИмяРеквизита + """ не заполнено";
	 	Сообщение.Сообщить();
		Возврат Истина
	КонецЕсли;
	
	Возврат Ложь
	
КонецФункции

&НаКлиенте
Процедура КатегорияТовараНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПолучитьДанныеВыбораНаСервере(ДанныеВыбора);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеВыбораНаСервере(ДанныеВыбора)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗначенияСвойствОбъектов.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	                      |ГДЕ
	                      |	ЗначенияСвойствОбъектов.Владелец = &Владелец");
	
	Запрос.УстановитьПараметр("Владелец", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "ГруппаТоваров"));
	
	ДанныеЗапроса = Запрос.Выполнить().Выгрузить();
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.ЗагрузитьЗначения(ДанныеЗапроса.ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры
